import styles from '@/styles/InformPages.module.scss';
import { Layout } from '@/layouts/Layout';
import { NextPage } from 'next';

const Agreement: NextPage = () => {
  return (
    <Layout title='Угода користувача'>
      <div className={styles.content}>
        <p>
          Вітаємо Вас на хмарному сервісі <strong>SkyData</strong> (далі -
          &quot;Сайт&quot;). Цей розділ &quot;Угода користувача&quot; (далі -
          &quot;Угода&quot;) встановлює умови використання Сайту. Будь ласка,
          уважно ознайомтесь з цими умовами перед використанням Сайту.
          Використовуючи Сайт, ви погоджуєтесь з усіма умовами цієї Угоди.
        </p>
        <h3>1. Використання вмісту Сайту</h3>
        <ul>
          <li>
            Весь вміст, розміщений на Сайті, включаючи, але не обмежуючись,
            тексти, графіку, фотографії, відео, аудіо, логотипи, дизайн, коди та
            інші матеріали (далі - &quot;Вміст&quot;), захищений авторським
            правом та іншими правами власності, і залишається власністю SkyData
            або третіх сторін, які надали ліцензію на використання такого
            Вмісту.
          </li>
          <li>
            Ви можете використовувати Вміст тільки для особистого,
            некомерційного використання. Заборонено копіювати, редагувати,
            розповсюджувати, передавати, публікувати, відтворювати або
            використовувати Вміст у комерційних цілях без письмового дозволу
            SkyData або відповідних правовласників.
          </li>
        </ul>
        <h3>2. Реєстрація користувача</h3>
        <ul>
          <li>
            Деякі функції Сайту можуть бути доступні лише зареєстрованим
            користувачам. Якщо ви обираєте зареєструватися на Сайті, ви
            зобов&apos;язуєтесь надати точні, повні та актуальні відомості про
            себе під час реєстрації, і підтримувати ці відомості актуальними в
            майбутньому.
          </li>
          <li>
            Ви несете відповідальність за збереження конфіденційності вашого
            облікового запису, включаючи пароль та інші облікові дані. Ви
            зобов&apos;язані повідомити SkyData про будь-яке несанкціоноване
            використання вашого облікового запису або будь-які порушення безпеки
            відразу після їх виявлення.
          </li>
        </ul>
        <h3>3. Поведінка користувача</h3>
        <ul>
          <li>
            Ви зобов&apos;язуєтесь використовувати Сайт лише в законних цілях та
            відповідно до цієї Угоди, а також з урахуванням відповідних
            законодавчих актів та правил використання Інтернету.
          </li>
          <li>
            Заборонено використовувати Сайт для розповсюдження незаконного,
            шкідливого, непристойного, образливого, дискримінаційного,
            неправдивого, обманливого, вульгарного, порнографічного,
            насильницького, загрозливого, спамного, вірусного або іншого
            неприпустимого вмісту.
          </li>
          <li>
            Заборонено втручання в роботу Сайту, включаючи спроби
            несанкціонованого доступу до системи, зламу, перешкоджання роботі
            серверів, введення шкідливих кодів або іншої діяльності, яка може
            завдати шкоди функціонуванню Сайту.
          </li>
          <li>
            Ви зобов&apos;язуєтесь не використовувати Сайт для збирання
            особистої інформації інших користувачів без їхньої згоди, а також не
            розміщувати будь-яку конфіденційну інформацію, таку як номери
            телефонів, адреси електронної пошти або фінансові дані, на Сайті.
          </li>
        </ul>
        <h3>4. Посилання на треті сторони</h3>
        <p>
          Сайт може містити посилання на веб-сторінки або ресурси, що належать
          третім сторонам. Ці посилання надаються лише для вашої зручності, і
          SkyData не має контролю над вмістом або діяльністю цих третіх сторін.
          SkyData не несе відповідальності за будь-який зміст або діяльність
          третіх сторін, включаючи, але не обмежуючись цим, їхні політики
          конфіденційності, правила використання та діяльність на їхніх
          веб-сайтах. Ви зобов&apos;язуєтесь використовувати посилання на треті
          сторони на власний ризик і відповідальність.
        </p>
        <h3>5. Інтелектуальна власність</h3>
        <ul>
          <li>
            Весь вміст, включаючи, але не обмежуючись цим, тексти, графіка,
            логотипи, зображення, відео, аудіо, програмне забезпечення та інші
            матеріали, що містяться на Сайті, є власністю SkyData або третіх
            сторін, які надали ліцензію SkyData на використання такого вмісту.
          </li>
          <li>
            Ви погоджуєтесь, що вам надається обмежена ліцензія на використання
            вмісту Сайту виключно для особистого, некомерційного використання, і
            ви не маєте права на передачу, продаж, розповсюдження, використання
            в комерційних цілях або зміну вмісту без письмового дозволу SkyData
            або відповідних власників прав на цей вміст.
          </li>
          <li>
            Ви зобов&apos;язуєтесь не порушувати права інтелектуальної власності
            SkyData або третіх сторін, включаючи, але не обмежуючись цим,
            авторські права, товарні знаки, патенти та інші права на вміст
            Сайту.
          </li>
        </ul>
        <h3>6. Відмова від відповідальності</h3>
        <ul>
          <li>
            Сайт надається на &quot;як є&quot; та &quot;як доступний&quot;
            основі. SkyData не гарантує, що Сайт буде безперебійним, без
            помилок, вільним від вірусів або інших шкідливх компонентів, або що
            доступ до Сайту буде безперервним або без помилок. Ви розумієте та
            погоджуєтесь, що використовуєте Сайт на свій власний ризик.
          </li>
          <li>
            SkyData не несе відповідальності за будь-які пошкодження, втрати
            даних або інші збитки, що виникли в результаті використання або
            нездатності використовувати Сайт, включаючи, але не обмежуючись цим,
            втрату прибутку, ділову репутацію, даних або можливість використання
            Сайту.
          </li>
        </ul>
        <h3>7. Зміни угоди</h3>
        <p>
          SkyData має право в будь-який час змінювати цю Угоду користувача,
          оновлювати або змінювати вміст Сайту без попереднього повідомлення.
          Ваше подальше використання Сайту після таких змін вважатиметься вашою
          згодою зі змінами угоди.
        </p>
        <h3>8. Розірвання угоди</h3>
        <p>
          SkyData може розірвати цю Угоду користувача в будь-який час без
          попереднього повідомлення і за будь-яких умов, або може припинити ваш
          доступ до Сайту за порушення вами цієї Угоди користувача.
        </p>
        <h3>9. Застосовне право та юрисдикція</h3>
        <p>
          Ця Угода користувача підпорядковується законам країни, в якій
          знаходиться SkyData. Ви погоджуєтеся, що будь-які спори, що виникають
          в зв&apos;язку з цією Угодою користувача або використанням Сайту,
          будуть вирішуватися в компетентному суді цієї країни.
        </p>
        <h3>10. Інші положення</h3>
        <ul>
          <li>
            Ця Угода користувача становить повний договір між вами та SkyData
            щодо використання Сайту, та замінює всі попередні або одночасні усні
            або підписані угоди або спілкування між вами та SkyData щодо Сайту.
          </li>
          <li>
            Якщо будь-яка частина цієї Угоди користувача визначиться недійсною
            або нездійсненною, це не вплине на дійсність або здійсненність інших
            положень цієї Угоди користувача.
          </li>
          <li>
            Відсутність дії з боку SkyData щодо порушення вами цієї Угоди
            користувача не звільняє їх від права захистити свої права в
            майбутньому в разі подібних або інших порушень.
          </li>
        </ul>
        <h3>11. Контактна інформація</h3>
        <p>
          Якщо у вас є питання, зауваження або скарги щодо цієї Угоди
          користувача або використання Сайту, будь ласка, зв&apos;яжіться з
          SkyData за наступною контактною інформацією:
          <br />
          <u>E-mail:</u> chaoschroniclesblog@gmail.com <br />
          <u>Telegram:</u>{' '}
          <a
            href='https://t.me/chaosChronicle_bot'
            target='_blank'
            rel='noreferrer'
          >
            https://t.me/chaosChronicle_bot
          </a>
        </p>
        <h3>12. Прийняття угоди</h3>
        <p>
          Ви підтверджуєте, що ознайомилися з цією Угодою користувача, розумієте
          її зміст і умови, та погоджуєтеся бути зв&apos;язаним її положеннями
          при використанні сайту SkyData.
        </p>
        <p>
          Це офіційний текст Угоди користувача для Сайту SkyData. Будь ласка,
          ознайомтеся з цими умовами уважно перед початком використання Сайту.
        </p>
      </div>
    </Layout>
  );
};

export default Agreement;
