import styles from '@/styles/InformPages.module.scss';
import { Layout } from '@/layouts/Layout';
import { warningSVG } from '@/static/svgSprite';
import { NextPage } from 'next';
import Link from 'next/link';

const Privacypolicy: NextPage = () => {
  return (
    <Layout title='Політика конфіденційності'>
      <div className={styles.content}>
        <p>
          Цей документ містить інформацію про збір, використання та розкриття
          особистої інформації користувачів сайту <strong>SkyDatas</strong>. Ми
          прагнемо забезпечити високий рівень захисту вашої приватності,
          дотримуючись вимог законодавства про захист персональних даних.
        </p>
        <h3>Збір та використання інформації</h3>
        <p>
          Ми збираємо особисту інформацію користувачів сайту лише з їх згоди, а
          також зібрану інформацію використовуємо лише з тими цілями, з якими
          вона була надана. Ми можемо збирати наступну інформацію:
        </p>
        <ul>
          <li>Ім&apos;я та прізвище;</li>
          <li>Електронна адреса;</li>
          <li>Номер телефону;</li>
          <li>Інші дані, які ви надаєте добровільно.</li>
        </ul>
        <p>
          Ми використовуємо зібрану інформацію для забезпечення функціонування
          сайту та надання послуг, з якими пов&apos;язаний сайт. Крім того, ми
          можемо використовувати інформацію для покращення якості послуг та для
          забезпечення безпеки нашого сайту.
        </p>
        <h3>Розкриття інформації третім особам</h3>
        <p>
          Ми не розкриваємо особисту інформацію користувачів сайту третім особам
          без їх згоди, за винятком випадків, передбачених законодавством. Ми
          можемо передавати інформацію третім особам лише в тому обсязі, який є
          необхідним для забезпечення послуг, з якими пов&apos;язаний сайт.
        </p>
        <h3>Захист інформації</h3>
        <p>
          Ми прикладаємо всі необхідні заходи для захисту особистої інформації
          користувачів від несанкціонованого доступу, втрати, зміни чи
          поширення.
        </p>
        <p>
          Ми застосовуємо сучасні методи захисту інформації, включаючи
          наприклад, такі методи захисту інформації, як шифрування даних,
          захищені з&apos;єднання і захист від вторгнень. Ми не розголошуємо
          особисту інформацію користувачів третім особам, якщо не отримали від
          них на це дозвіл. Крім того, наша політика конфіденційності періодично
          оновлюється з урахуванням сучасних вимог і стандартів.
        </p>
        <p>
          Якщо ви маєте питання або пропозиції щодо нашої політики
          конфіденційності, будь ласка, зв&apos;яжіться з нами за будь-яким з
          наших <Link href='/contacts'>контактів</Link>.
        </p>
      </div>
      <div className={styles.content} id='deleteAccount'>
        <h3>
          Процедура видалення облікового запису користувача з сайту SkyData
          наступна:
        </h3>
        <ol>
          <li>
            Авторизуйтесь на сайті SkyData за допомогою своїх облікових даних
            (електронна пошта та пароль) або акаунту соцмережі.
          </li>
          <li>
            Після успішного входу, перейдіть до розділу{' '}
            <Link href='/dashboard/userSettings'>&quot;Налаштування&quot;</Link>{' '}
            за допомогю меню, що знаходиться у верхньому правому куті сайта.
          </li>
          <li>
            В частині &quot;Видалення облікового запису&quot; знайдіть кнопку
            &quot;Видалити&quot;, що дозволяє видалити обліковий запис. Клікніть
            на цю кнопку.
          </li>
          <li>Підтвердьте видалення облікового запису за необхідності.</li>
          <li>
            Завершивши процедуру видалення, Ваш обліковий запис та всю
            інформацію, пов&apos;язану з ним на сайті SkyData буде безповоротно
            видало.
          </li>
        </ol>
        <p>
          {warningSVG}
          <b>Попередження:</b> Видалення облікового запису - незворотня
          процедура, що призведе до видалення всіх Ваших файлів, які
          зберігаються на серверах SkyData. Переконайтеся, що Ви зрозуміли
          наслідки видалення облікового запису перед тим, як розпочати
          процедуру.
        </p>
      </div>
    </Layout>
  );
};

export default Privacypolicy;
